# AnalyticalSystemDomain Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSystem..::..AnalyticalSystemDomain Property
MEPAnalyticalSystem Class See Also
---
The type of analytical system.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public AnalyticalSystemDomain AnalyticalSystemDomain { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AnalyticalSystemDomain As AnalyticalSystemDomain
	Get
```

Visual C++
---
```text
public:
property AnalyticalSystemDomain AnalyticalSystemDomain {
	AnalyticalSystemDomain get ();
}
```

# See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace